```
?- select(10,[1,2,3],R).
false.

?- select(2,[1,2,3],R).
R = [1, 3] ;
false.

?- select(2,[1,2,3,2,4],R).
R = [1, 3, 2, 4] ;
R = [1, 2, 3, 4] ;
false.

?- select(2,[1,2,3,2,4,2],R).
R = [1, 3, 2, 4, 2] ;
R = [1, 2, 3, 4, 2] ;
R = [1, 2, 3, 2, 4].
```
